{"_id":{"$oid":"5965e14c4024fb2658fa8a6d"},"updatedAt":{"$date":"2017-07-12T08:44:37.414Z"},"createdAt":{"$date":"2017-07-12T08:43:56.230Z"},"title":"Exercice 1","published":true,"content":"email : jaja@jaja.com password : jaja.\nforker un projet consiste à récupérer un projet github pour le mettre dans ses propres repo et ainsi pouvoir travailler dessus sans affecter l'original.\nune pull request permet de récupérer les informations d'une branche d'un repository, ce qui permet par exemple de travailler sans crainte de perdre son travail si l'on fais une mauvaise manipulation ainsi que de récupérer le travail de quelqu'un d'autre.\nun branche est une partie d'un projet qui n'interfère pas avec les autres. de cette manière on peut travailler sans crainte d'écraser le travail de quelqu'un d'autre et on peut faire ses expérimentations.\nà la différence d'un fork, un  branche se trouve sur le même repository que le reste du projet.","__v":0}
{"_id":{"$oid":"5965ea034024fb2658fa8a6e"},"updatedAt":{"$date":"2017-07-12T09:21:07.882Z"},"createdAt":{"$date":"2017-07-12T09:21:07.882Z"},"title":"la MEAN stack","published":true,"content":"Angular :\nC'est un framework fornt-end de javacript permettant de créer des SPA (single page application). \nAngular UI Router : \nIl s'agit d'un module npm pour angular permettant de perfectionner et simplifier l'utilisation des routes angular.\nExpress:\nC'est un framework permettant de perfectionner les routes de nodejs, il permet nottament d'analyser les requêtes avec plus de précision ( analyse des méthodes )\nJSONWebToken: \nC'est un moyen de créer un système d'authentification en créant un token stockant des informations cryptées de l'utilisateur, ce qui  permettra de vérifier de la légitimitée de l'utilisateur.\nMongoose: \nC'est un framework permettant la manipulation de donnée d'une base de donnée mongoDB ( CRUD ).\nMaterializeCSS:\nC'est un framework CSS permettant d'intégrer rapidement et efficacement des éléments de design à notre vue.\nPassport:\nC'est un module npm permettant la sécurisation d'un système d'authentification via par exemple la vérifiacation des données d'un token.\nBabel: \nc'est un linter permettant de réduire la taille de notre code et de vérifer en même temps l'intégritée de nortre code.\nSCSS: \nC'est un langage améliorant le css permettant un indentation, l'utilisation de variables et de fonctions.\nNodemon: \nC'est un outil permettant de lancer un live-server local pour nodejs.\nWebpack: \nWebpack est un outil permettant la compilation de notre code pour le rendre lisible par le navigateur.\nLivereload: \nNous permet de toucher à notre code et de le changer directement dans webpack.\n\n_____________\n\nLa MEAN stack ( mongoDB express angular node ) sert à créer une SPA, où angular requêtera node pour l'échange d'information front back.\nNode dans un premier temps enverra dans un premier temps l'application angular dans son ensemble, puis angular requêtera node qui interprettra via express ces demandes puis intérragira via mongoose avec node base de donnée mongoDB.\n\nElle sera utilisée autant côté front que back. \n\nMaterialize n'intervenant pas dans la MEAN stack, nous pourrions l'enlever du projet même si cela impliquerai de changer plusieurs choses pour rendre le site à nouveau joli.","__v":0}
{"_id":{"$oid":"59662d20ab106379f1202e66"},"updatedAt":{"$date":"2017-07-12T14:07:28.494Z"},"createdAt":{"$date":"2017-07-12T14:07:28.494Z"},"title":"Exercice 7","content":"*Que sont les méthodes agiles ? \nLes méthodes agiles sont méthodes de gestion de projet permettant une meilleure cohésion et une meilleure productivité.\n\n*Qu’est-ce que SCRUM ? \nLa méthode SCRUM ( mêlée en anglais ) est une méthode agile établissant des rôles (Product Owner, SCRUM Master et Development Team) et se divisant en plusieurs sprint (phase de développement).\n\n*Définir le Product BackLog, de quoi est-il constitué ? \nLe Product BackLog, c'est le \"quoi' : on y établi ce qui doit être fait ainsi que la priorité de chaque fonctionnalitée. \n\n*Définir le Product Owner\nLe Product Owner est le plus souvent le client,  c'est la personne à qui nous livrons notre produit.\n\n*Définir le SCRUM Master\nLe SCRUM Master est le garant de l'application de la méthodologie SCRUM, et orgonise les équipes ( une sorte de chef de projet ).\n\n*Définir la « Development team »\nla Development team est l'équipe de développement, ce sont les personnes qui réalisent le produit.\n\n*Définir le Sprint, de quoi est-il constitué ?\naprès sa planification, on execute les tâches établies au préalable dans le sprint backlog tout au long de sa durée (généralement 2 à 4 semaines)\n\n*Définir le daily scrum\nc'est une réunion quotidienne prendant laquelle nous mettons en avant les réussites et les échecs du jour précédant, mettant ainsi au clair la suite des évènements à venir.\n\n*Qu’est-ce que la planification d’un sprint ?\nOn y établi le sprint backlog, c'est à dire l'ensemble des tâches à accomplir lors du sprint à venir.\n \n*Qu’est-ce que la révision d’un sprint ?\nLa révision du print consiste à réévaluer les tâches à accomplir si l'on a pris de l'avance ou du retard sur le sprint backlog.\n\n*Qu’est-ce que la rétrospective d’un sprint ?\nC'est une réunion lors de laquelle on récapitule ce que l'on a réussi à accomplire lors d'un sprint.\n\n*Pourquoi est-il important de définir la notion de « Done » pour les tâches ?\ncela permet de planifier la suite des tâches à accomplir en fonction du product backlog ainsi que pour les tâches ne pouvant être réalisée sans une autre fonctionnalité.\n\n*La notion de « Done » peut-elle évoluer au cours d’un projet SCRUM ? \nOui car on ne peut pas forcément se rendre compte des implications du développement de châques fonctionnalités.\n\n*SCRUM est-elle une méthodologie itérative ? Justifier.\nC'est une méthodologie itérative car on répète le même processus jusqu'à ce qque le produit soit treminé.","published":true,"__v":0}
